#  Counting missing rows with left join

##  Assignment 

The Movie Database is supported by volunteers going out into the world, collecting data, and entering it into the database. This includes financial data, such as movie budget and revenue. If you wanted to know which movies are still missing data, you could use a left join to identify them. Practice using a left join by merging the `movies` table and the `financials` table.

The `movies` and `financials` tables have been loaded for you.

##  Pre exercise code 

```
from pickle import load
import urllib.request
import pandas as pd

fn_mov = 'https://assets.datacamp.com/production/repositories/5486/datasets/81f8f3290520b0a9bdc6d77deaac87a9d298de46/movies.p'
fn_fin = 'https://assets.datacamp.com/production/repositories/5486/datasets/e8f6bb0393b96bad22d50e42d5a9db1bbb643aa8/financials.p'

movies = load(urllib.request.urlopen(fn_mov))
financials = load(urllib.request.urlopen(fn_fin))
```

In [1]:
from pickle import load
import urllib.request
import pandas as pd

In [2]:
fn_mov = 'https://assets.datacamp.com/production/repositories/5486/datasets/81f8f3290520b0a9bdc6d77deaac87a9d298de46/movies.p'
fn_fin = 'https://assets.datacamp.com/production/repositories/5486/datasets/e8f6bb0393b96bad22d50e42d5a9db1bbb643aa8/financials.p'
movies = load(urllib.request.urlopen(fn_mov))
financials = load(urllib.request.urlopen(fn_fin))

In [3]:
movies.head(1)

    id         title  popularity release_date
0  257  Oliver Twist   20.415572   2005-09-23

In [4]:
financials.head(1)

      id     budget       revenue
0  19995  237000000  2.787965e+09

In [6]:
mov_fin = movies.merge(financials, on="id", how="left")

In [7]:
mov_fin.head()

,id,title,popularity,release_date,budget,revenue
0,257,Oliver Twist,20.415572,2005-09-23,50000000.0,42093706.0
1,14290,Better Luck Tomorrow,3.877036,2002-01-12,NaN,NaN
2,38365,Grown Ups,38.864027,2010-06-24,80000000.0,271430189.0
3,9672,Infamous,3.680896,2006-11-16,13000000.0,1151330.0
4,12819,Alpha and Omega,12.300789,2010-09-17,20000000.0,39300000.0

In [12]:
mov_fin[(mov_fin["budget"].isna())]

,id,title,popularity,release_date,budget,revenue
1,14290,Better Luck Tomorrow,3.877036,2002-01-12,NaN,NaN
7,13785,Best in Show,10.982255,2000-09-19,NaN,NaN
9,18841,The Lost Skeleton of Cadavra,1.680525,2001-09-12,NaN,NaN
11,158752,Escape from Tomorrow,1.352222,2013-10-11,NaN,NaN
15,16186,Diary of a Mad Black Woman,3.784535,2005-02-25,NaN,NaN
...,...,...,...,...,...,...
4783,17334,The Other End of the Line,3.393648,2008-10-29,NaN,NaN
4788,25189,The Mirror Has Two Faces,3.844926,1996-11-15,NaN,NaN
4793,198370,Mutual Friends,0.136721,2014-04-15,NaN,NaN
4799,11934,The Hudsucker Proxy,14.188982,1994-03-11,NaN,NaN
4800,13807,Exiled,8.486390,2006-09-06,NaN,NaN

##  Instructions 

- Merge the `movies` table, as the left table, with the `financials` table using a left join, and save the result to `movies_financials`.

In [14]:
movies_financials = movies.merge(financials, on="id")

- Count the number of rows in `movies_financials` with a null value in the `budget` column.

In [23]:
mov_fin["budget"].isna().sum()

1574